{
  "Rooms": {
    "welcome": {
      "description": "Welcome to zWork, or as I'd rather have it known, The Incredible Heist! In this true-to-life retelling of a fantastical case of industrial espionage, you play as a plucky, hard-boiled office employee who might just have had one coffee too many. Taking place at the end of the autobiographic novel of the same name, your task is now to pick up 'The Payload' via your super secret floppy disk from your manager Alan's cubicle and escape the office unseen - risks be damned.\n\nYou play by typing commands like 'look at [object]', 'use [object]', 'take [object]', 'move to [location]', or 'inventory'. Typing 'help' will display this again.\n\nTo begin the adventure, type 'move your desk'.",
      "connections": ["your_desk"],
      "objects": {}
    },
    "your_desk": {
      "description": "You are standing by your desk. The sickening yellow glow of the <i>computer</i> screen pollutes the immediate environs, dispelling any capacity for levity within 2 yards.\n\nThis might not seem like much, but it is only one such repository in a gridlock of wall-less cubicles.\n\nThis might be your last time at the desk, but there is no love lost for the memories you are leaving behind. You check that you have your floppy disk and prepare to get serious.",
      "connections": ["coffee_machine", "superior_section"],
      "objects": {
        "computer": {
          "text": "Your computer sits ominously at your desk, ready to devour your sanity given the chance.",
          "conditions": [
            {
              "condition": "!triedSuperior",
              "text": "You take a deep breath: This should be quick.\n\nYou boot up the work program and start wailing away on the keyboard.\n\nLiterally.\n\nSome look at you in confusion, while others nod sagely, recognizing someone breaking, and respectfully give you the space you need.\n\nWhen you hit your 37th failed word, a red message appears in the corner: 'Supervisor Alan has been notified. Please go to room 13784p6 for your meeting [A Quick Chat]. Bring the printout notice.'\n\nYou saw Alan leave hours ago... But now that you know which office to visit, you can safely get your payday.\n\nThe computer prints out a notice with the office number, which you disrespectfully put in your pocket.",
              "actions": ["notice", "triedSuperior"],
              "actionType": "use"
            },
            {
              "condition": "triedSuperior",
              "text": "You've already used the computer and obtained the notice.",
              "actionType": "use"
            }
          ]
        },
        "under_your_desk": {
          "text": "Under your desk, you find a blue puzzle piece.",
          "conditions": [
            {
              "condition": "!blue_puzzle_piece",
              "text": "For old times' sake, you take a quick peek under your desk. The calendar hangs in the corner, and the crime novel you never got to finish is currently supporting one of the legs on the desk.\n\nSomething's different, though. Right below your chair lies a blue corner-piece of a puzzle, with the text 'O:roomFirst the' written in very fine print on it.",
              "actionType": "look"
            },
            {
              "condition": "!have_blue_puzzle_piece",
              "text": "You pick up the blue puzzle piece.",
              "actions": ["blue_puzzle_piece"],
              "actionType": "take"
            },
            {
              "condition": "blue_puzzle_piece",
              "text": "There's nothing else under the desk.",
              "actionType": "look"
            }
          ]
        },
        "room": {
          "text": "You observe the room. In this enigmatic tube of an office, an array of <i>computer</i> screens are in sight any way you turn—while you would think looking at the walls would give you a brief reprieve from THE YELLOW LIGHT, lines of head-height mirrors have been installed to make sure that the only place to escape the galling glow is in a fetal position <i>under your desk</i>.\n\nCurrently, only seven fellow office workers are resorting to this. A record low number!\nWestwards, the <b>superior section</b> looms insignificantly, while to your south, the <b>coffee machine</b> rests."
        }
      }
    },
    "coffee_machine": {
      "description": "Like an oasis in the desert, the <i>coffee machine</i> is a beacon of hope in the realms of despair. Strangely enough, nobody is here at the moment... But that suits your purposes just fine.",
      "connections": ["your_desk", "superior_section", "office_entrance"],
      "objects": {
        "coffee_machine": {
          "text": "The coffee machine looks inviting.",
          "conditions": [
            {
              "condition": "emptyCoffee && !fullCoffee",
              "text": "You have a cup ready to be filled. The coffee machine awaits your command.",
              "actionType": "look"
            },
            {
              "condition": "!emptyCoffee && !fullCoffee",
              "text": "You gaze longingly at the coffee machine. If only you had a cup...",
              "actionType": "look"
            },
            {
              "condition": "fullCoffee",
              "text": "Your cup is already full of coffee. Time to put it to good use.",
              "actionType": "look"
            },
            {
              "condition": "emptyCoffee && !fullCoffee",
              "text": "You place the coffee cup on the coffee machine and press the button. Ten seconds later, a shot of dangerously hot, strangely viscous, and immorally seductive coffee pours into your cup. Serotonin flashes through your body. Stay strong; you might need this later.",
              "actions": ["fullCoffee", "!emptyCoffee"],
              "actionType": "use"
            },
            {
              "condition": "!emptyCoffee && !fullCoffee",
              "text": "There is coffee; but, alas, you have no cup.",
              "actionType": "use"
            },
            {
              "condition": "fullCoffee",
              "text": "Your cup runneth over... well, not actually, but the coffee machine is rigged to break if an already filled cup gets a second helping.\n You choose not to break the coffee machine, for the others' sake.",
              "actionType": "use"
            }
          ]
        },
        "trolley": {
          "text": "A small, rickety trolley with 'coffee paraphernalia' is here.",
          "conditions": [
            {
              "condition": "",
              "text": "The Trolley contains three <i>cups</i>, nine tea spoons and one packet of sweetener. \n From experience, you know that milk and other condiments must be brought from home... But given the lack of storage after what HR has labeled 'the incident', few choose to bring milk outside of the winter months.",
              "actionType": "look"
            }
          ]
        },
        "cup": {
          "text": "Three coffee cups are on the trolley.",
          "conditions": [
            {
              "condition": "!emptyCoffee",
              "text": "You take a coffee <b>cup</b> from the Trolley, which causes it to lose balance and shake uncontrollably. You briefly think to report to HR that a <i>wheel</i> on the Trolley might be in disrepair, but then you remember that 1) they would not lift a finger to solve it, and 2) this will soon no longer be your problem.",
              "actions": ["emptyCoffee"],
              "actionType": "take"
            },
            {
              "condition": "emptyCoffee || fullCoffee",
              "text": "Given the coffee cup shortage, you choose to let some poor souls find solace in the remaining cups.",
              "actionType": "take"
            }
          ]
        },
        "wheel": {
          "text": "A wheel on the trolley looks see-through, but it's just vibrating v e r y fast.",
          "conditions": [
            {
              "condition": "!red_puzzle_piece",
              "text": "You take a closer look at the vibrating wheel. While helpfully poking it with the packet of sweetener, a red puzzle piece flies out of the spokes, ricocheting around the room—but thankfully missing the all-important coffee tubes. When you take a closer look at it, you see that 'R:trolley Trolley' is printed on it.",
              "actionType": "look"
            },
            {
              "condition": "!have_red_puzzle_piece",
              "text": "You pick up the red puzzle piece.",
              "actions": ["red_puzzle_piece"],
              "actionType": "take"
            },
            {
              "condition": "red_puzzle_piece",
              "text": "You have already taken the puzzle piece from the wheel. Seek no further demise in its oscillation.",
              "actionType": "look"
            }
          ]
        },
        "room": {
          "text": "The room is quiet — too quiet. A <i>coffee machine</i> rests awkwardly on a pillar a little too low in what is nearly the center of the room, with several connecting tubes and cables lying loosely between it and the northern wall. A small, rickety <i>trolley</i> has been placed next to it, with what you could call 'coffee paraphernalia.'\n\nYou can see the pale blue lights from the <b>superior section</b> reflect along the walls of the hallway northwest, while to the north you feel the yellow glow of <b>your desk</b>. Further south, the <b>office entrance</b> taunts you with its dark embrace. Literally! The lights went out last month, and they have yet to fix them."
        }
      }
    },
    "office_entrance": {
      "description": "In the darkness, you sense it. Freedom. So close. Too close...",
      "connections": ["your_desk", "coffee_machine", "home"],
      "objects": {
        "door": {
          "text": "A large steel door blocks the way out.",
          "conditions": [
            {
              "condition": "!secretFloppy",
              "text": "The steel door blocks your way. You could easily cross that barrier with your employee ID card, but as luck would have it, your manager, Alan, has it in his office for safekeeping.",
              "actionType": "look"
            },
            {
              "condition": "secretFloppy",
              "text": "These puny steel doors cannot hold you back from your glorious <b>home</b> any longer, for you are...\n\nSomeone with an employee card!",
              "actions": ["move_home"],
              "actionType": "use"
            }
          ]
        },
        "doormat": {
          "text": "A doormat that reads 'thank you for coming!!' lies here.",
          "conditions": [
            {
              "condition": "!green_puzzle_piece",
              "text": "You check the doormat. You find a strange green puzzle piece with 'D:toilet #' etched into it.",
              "actionType": "look"
            },
            {
              "condition": "!have_green_puzzle_piece",
              "text": "You pick up the green puzzle piece.",
              "actions": ["green_puzzle_piece"],
              "actionType": "take"
            },
            {
              "condition": "green_puzzle_piece",
              "text": "It's just a doormat. with a puzzle-shaped indent from where you picked up the piece from underneath it.\n... I hope it wasn't a load-bearing puzzle piece.",
              "actionType": "look"
            }
          ]
        },
        "toilet": {
          "text": "The singular toilet of the office is busy, as usual.",
          "conditions": [
            {
              "condition": "",
              "text": "You suspect that the door was welded shut long before you started working here.",
              "actionType": "look"
            }
          ]
        },
        "room": {
          "text": "The dimly lit room is akin to a fortress bastion: A large steel <b>door</b> blocks the way out, with an out-of-place card reader on the slanting wall next to it.\n\nIn an attempt at humor from HR that is too little too late, a <i>doormat</i> that reads 'thank you for coming!!' with an overly enthusiastic legally distinct mouse lies in front of the entrance. The <i>toilet</i> is 'accessible' via a door to the left of the entrance, but is better appreciated as a modern art piece or statement.\n\nTo the north, the <b>coffee machine</b> beckons.\nThrough the entrance, you feel the call of <b>home</b>, but it might not yet be time.\nTo the west, the paradoxical one-way door to <b>your desk</b> lies open."
        }
      }
    },
    "superior_section": {
      "description": "You are standing at the gates of those with the power to take your joy. One would think that they might use this joy for something useful, but so far, the bi-yearly (no, not the twice-a-year kind) pizza party is the closest they have gotten... And they made sure to pick pizza pies not chosen from the survey.\nSomewhere, <b>Alan's desk</b> lays hidden among the cubicles. You will not find kind souls here; best do what needs to be done and get yourself away from this place.",
      "connections": ["your_desk", "coffee_machine"],
      "objects": {
        "potted_plant": {
          "text": "A potted plant struggles to bring life to the joy-sucking landscape and fails miserably.",
          "conditions": [
            {
              "condition": "!cyan_puzzle_piece && !fullCoffee",
              "text": "You notice something stuck between the branches, but it won't budge. Perhaps if you were to weaken the plant...",
              "actionType": "look"
            },
            {
              "condition": "!cyan_puzzle_piece && fullCoffee",
              "text": "While ruminating, the coffee cup you have been mindlessly carrying along with you tips fatally onto the plant. The branches and leaves flail around for a second, and you can swear you heard a muffled cry as the spilled coffee disintegrates part of the feeble flora.\nYou feel slightly bad, but quickly forget as you now can pick up the strange object you saw earlier. It turns out to be a cyan-colored puzzle piece, with the text 'V:trophy rank' taped onto it.",
              "actions": ["cyan_puzzle_piece", "!fullCoffee"],
              "actionType": "use"
            },
            {
              "condition": "cyan_puzzle_piece",
              "text": "Poor plant. It deserved better.",
              "actionType": "look"
            }
          ]
        },
        "map": {
          "text": "A map that more closely resembles a magic eye painting hangs on the cubicle walls.",
          "conditions": [
            {
              "condition": "!notice",
              "text": "You try to understand the map to no avail. At the bottom, it reads: 'Cross-reference your superior meeting notice with directional chart for directions.'You try to understand the map to no avail - you cannot remember your trigonometry well enough to figure out the position and angle you have to cross your eyes at to read the map. \n As your spirit sinks, you notice a small line of text at the bottom of the A5-printout that reads 'cross-reference your superior meeting notice from poor performance with directional chart for directions.' \n So... If you perform poorly, you get a guiding star to your goal? \n \n You have been waiting for this.",
              "actionType": "look"
            },
            {
              "condition": "notice",
              "text": "Using the notice, the path you need to take suddenly becomes clear. Holding the notice in front of you like a warding signet, you carefully tread the cubicles, making sure not to make eye contact with anything not residing in your goal. \n \n After what feels like hours, you realize you have arrived at Alan's cubicle. \n It would be wise to look around <i>Alan's desk</i>.",
              "actions": ["inOffice"],
              "actionType": "use"
            }
          ]
        },
        "alan's_desk": {
          "text": "Alan's desk is here.",
          "conditions": [
            {
              "condition": "inOffice",
              "text": "Alan's office is... muted, to put it nicely. Alan's computer is on his desk, with the <i>floppy receptacle</i> dangerously unguarded, along with a stack of key cards lying on top of it, held in place by a trophy that reads 'Second Best Employee of 19th of April'. A strange <i>puzzle</i> lies next to the computer. \n If you are ready to escape from this cursed place: To the east, Your Desk is patiently waiting for your retreat. To the south-east, The coffee machine is ready to comfort you.",
              "actionType": "look"
            },
            {
              "condition": "!inOffice",
              "text": "You consider looking into one of the other offices. Maybe you can bypass having to find Alan's office with ther <i>map</i>? \n As you take a tentative step, you hear a muffled cough. \n Losing your nerve, you skedaddle back to the entrance of the cubicles. Better to play it safe and find an excuse to visit Alan's cubicle.",
              "actionType": "look"
            }
          ]
        },
        "floppy_receptacle": {
          "text": "Alan's computer is on his desk.",
          "conditions": [
            {
              "condition": "inOffice && !secretFloppy",
              "text": "At last!\nYou rush over to the floppy receptacle and shove your floppy disk in. Some smooth keyboard taps later you get the satisfying 'data transfer complete' message on the blue computer screen, and—\n\nHey, hang on, managers get BLUE screens? That's unfair! *I* want a blue screen!\n\n... Nevermind, you got what you came for, and soon you can kiss this life of torpor goodbye.\n\nYou eject the floppy disk and pick up your employee badge.\n\nYou are ready to leave.",
              "actions": ["secretFloppy"],
              "actionType": "use"
            },
            {
              "condition": "secretFloppy",
              "text": "You take a minute to envy the blue screen.",
              "actionType": "look"
            },
			{
              "condition": "!inOffice && !secretFloppy",
              "text": "It is not within sight. Drat!",
              "actionType": "look"
            }
          ]
        },
		"puzzle": {
          "text": "A strange puzzle lies next to the computer.",
          "conditions": [
            {
              "condition": "!inOffice",
              "text": "Yes, this situation surely is quite the puzzle.",
              "actionType": "look"
            },
            {
              "condition": "inOffice",
              "text": "The puzzle on the desk is... Puzzling. \n An explosion of colored squares covers the newspaper cutout, with five prominently missing squares. A smart-looking anthromorphic light bulb has a speech bubble next to it saying 'can YOU solve this poignant pickle of a puzzle? Write it into the <i>terminal</i> for a secret message!' \n While you surely cannot make heads nor tails of this bizarre statement, perhaps someone outside the four walls of this entirely real and not digital office can.",
              "actionType": "look"
            }
          ]
        },
		"terminal": {
          "text": "A terminal certainly exists somewhere in the time-space continuum.",
          "conditions": [
            {
              "condition": "!inOffice",
              "text": "Yes, having to stay even a day longer in this hole would have terminal consequences in the long term. Ask your psychologist, they'll agree.",
              "actionType": "look"
            },
            {
              "condition": "inOffice && red_puzzle_piece && blue_puzzle_piece && green_puzzle_piece && cyan_puzzle_piece && yellow_puzzle_piece",
              "text": "Pondering the pulitzer puzzle, you glance up at the computer Terminal. \n Somehow, it was primed to accept five inputs, with some strange line breaks appearing between some letters: \n \n _ _ _ _ - _ C K ! \n \n What this means and where to use it is anyone's guess. Surely, there must be somewhere to put this in... but not while playing this award-winning adventure game. Somehow, you are forced to wink.",
              "actionType": "look"
            },
			"condition": "(!red_puzzle_piece && inOffice)|| (!blue_puzzle_piece && inOffice) || (!green_puzzle_piece && inOffice) || (!cyan_puzzle_piece && inOffice) || (!yellow_puzzle_piece && inOffice)",
              "text": "You look around to figure out what 'the Terminal' could mean, but the answer eludes you. Perhaps you need more pieces to solve the puzzle?",
              "actionType": "look"
          ]
        },
        "room": {
          "text": "In the surgical blue light, a village of cubicles builds the image of a modern crypt — you can almost swear you see a trail of smoke sweep between the empty spaces in the distance. A <i>potted plant</i> struggles to bring life to the joy-sucking landscape and fails miserably. A <i>map</i> that more closely resembles a magic eye painting hangs on the cubicle wallson the outskirts of the cubicle town.\nWhile you are looking for the cubicle of your manager, Alan, there are other offices around, but it might not be a good idea to poke your nose where pay cuts lie waiting.\nTo the east, <b>your desk</b> is patiently waiting for your retreat. To the southeast, the <b>coffee machine</b> is ready to comfort you."
        }
      }
    },
    "home": {
      "description": "You have done it.\n\nYou open the door, and your beagle dog, <i>Markie</i>, gives you a warm welcome. You turn on the lights, and your cozy apartment springs to life: The radio plays a snazzy tune dedicated to your victory, your cork<i>board</i> basking in the evening light, and your favorite show starts playing on your television—and it's the start of the next episode you were going to watch!\n\nAll is, once again, well.",
      "connections": [],
      "objects": {
        "markie": {
          "text": "Markie slobbers by your legs, following your every move. \n You pet Markie. \n Life improves.",
          "conditions": [
            {
              "condition": "!yellow_puzzle_piece",
              "text": "You pet Markie once more. Feeling playful, you pull an old trick Markie has seen a hundred times, yet the treat he gets at the end gets him jumping every time. 'Oh, what's that behind your ear, Markie,' you posit. \n Markie freezes, recognizing this song and dance. His tail starts spinning up. \n 'Why, would you look at that! It's a...' \n ... \n ...You hold a yellow puzzle piece in your hand. On it, 'A:rooms amnt.' is written in impeccable penmanship. \n You both stare at the puzzle piece dumbfounded for a few moments. A treat falls from behind the puzzle piece, breaking the spell, and Markie starts running, jumping, and barking across the room in glee.",
              "actions": ["yellow_puzzle_piece"],
              "actionType": "look"
            },
            {
              "condition": "yellow_puzzle_piece",
              "text": "You pet Markie once more. Feeling playful, you pull an old trick Markie has seen a hundred times, yet the treat he gets at the end gets him jumping every time. 'Oh, what's that behind your ear, Markie,' you posit. \n Markie freezes, recognizing this song and dance. His tail starts spinning up. Given the previous result you feel some trepidation, but for Markie's sake you must attempt the trick once more. \n 'Why, would you look at that! It's a...' \n ... \n ...'Treat, just for you!' You toss the treat to Markie, and Markie starts running, jumping, and barking across the room in glee.",
              "actionType": "look"
            }
          ]
        },
        "board": {
          "text": "A large cork board full of images of Markie hangs on the wall.",
          "conditions": [
            {
              "condition": "!the_solution",
              "text": "You look at the cork board. Months from now, you will surely look back on this, thinking you were insane. But right now, you bask in its glory.\n\nAll the pages of the workplace contract are hung up on this cork board, from end to end. It is an item all employees have, including the cork board, of course.\nMost probably put it away in storage, but not you. You needed to remind yourself why you were doing this.\n\nOn top of the contract pages, an album's worth of images of Markie has been pinned, obscuring most of the message. But a red thread connects certain letters on the board to form a message, engraved in your heart:\n\n<color=#008000>CATHARSIS</color>.\nTo you, this is a secret word that has opened more doors than you can possibly count.\n\nBut to YOU, sitting there, this might just be what you need to receive a sliver of the solace gained by reaching my home.\nIn the end, you just need to make it <color=#008000>WORK</color>.",
              "actions": ["the_solution"],
              "actionType": "look"
            },
            {
              "condition": "the_solution",
              "text": "You've already noted the message on the board.",
              "actionType": "look"
            }
          ]
        },
        "room": {
          "text": "The apartment is exactly as you remember it. It might not be large, but it is enough for you and Markie. The living room has the television on one end, and an old, green sofa opposite it. A 70's coffee table bought in a yard sale sits at an angle in the middle of the room. On the wall above the sofa hangs a large cork <i>board</i>, full of images of <i>Markie</i>. Everyone who has visited has given your feng shui critique, but you do not care; the chaos gave you energy to survive the order at your workplace. \n If this were any other day, you would dread the time you had to leave the front door to go back to the office via the <b>office entrance</b>... But now, you may finally rest."
        }
      }
    }
  },
  "inventory": {
    "floppy": {
      "text": "A completely ordinary floppy disk, just waiting to absorb company secrets.",
      "conditions": [
        {
          "condition": "floppy",
          "text": "A completely ordinary floppy disk. Promise.",
          "actionType": "look"
        }
      ]
    },
    "cup": {
      "text": "A coffee cup, some time known to bear the weight of your world.",
      "conditions": [
        {
          "condition": "fullCoffee",
          "text": "In your hand you have a cup of desirable coffee. You wonder how this legal miracle drug came to be, given that the first set of coffee beans must have been only available in very obscure locales, based on the period they were popularized. \n \n You look down at the cup again - but it is empty! While furious that someone stole your coffee, you notice an acrid taste in the back of your throat. Once again, you had subconciously devoured the coffee while your mind wandered. You quickly go and get yourself a refill.",
          "actionType": "look"
        },
        {
          "condition": "emptyCoffee",
          "text": "There is nothing in your coffee cup. You should put something appropriate in there.",
          "actionType": "look"
        },
        {
          "condition": "!emptyCoffee && !fullCoffee",
          "text": "Sadly, you have no coffee cup. Your life would improve if you did.",
          "actionType": "look"
        }
      ]
    },
    "notice": {
      "text": "A notice with a room number.",
      "conditions": [
        {
          "condition": "notice",
          "text": "A notice given to you after identifying an issue between chair and screen. The room number lets you identify a path to Alan's cubicle and grants you safe passage from other watchful supervisors.",
          "actionType": "look"
        },
        {
          "condition": "!notice",
          "text": "Notice what? I don't get it.",
          "actionType": "look"
        }
      ]
    },
    "blue_puzzle_piece": {
      "text": "A puzzle piece, with the text 'O:roomFirst the' written in very fine print on it.",
      "conditions": [
        {
          "condition": "blue_puzzle_piece",
          "text": "A puzzle piece, with the text 'O:roomFirst the' written in very fine print on it.",
          "actionType": "look"
        },
		{
          "condition": "!blue_puzzle_piece",
          "text": "You have yet to find this puzzle piece.",
          "actionType": "look"
        }
      ]
    },
    "red_puzzle_piece": {
      "text": "A puzzle piece, with the text 'R:trolley Trolley' printed on it.",
      "conditions": [
        {
          "condition": "red_puzzle_piece",
          "text": "A puzzle piece, with the text 'R:trolley Trolley' printed on it.",
          "actionType": "look"
        },
		{
          "condition": "!red_puzzle_piece",
          "text": "You have yet to find this puzzle piece.",
          "actionType": "look"
        }
      ]
    },
    "green_puzzle_piece": {
      "text": "A puzzle piece. Someone has used a knife to etch the words 'D:toilet #' into it.",
      "conditions": [
        {
          "condition": "green_puzzle_piece",
          "text": "A puzzle piece. Someone has used a knife to etch the words 'D:toilet #' into it.",
          "actionType": "look"
        },
		{
          "condition": "!green_puzzle_piece",
          "text": "You have yet to find this puzzle piece.",
          "actionType": "look"
        }
      ]
    },
    "cyan_puzzle_piece": {
      "text": "A puzzle piece with the text 'V:trophy rank' taped onto it.",
      "conditions": [
        {
          "condition": "cyan_puzzle_piece",
          "text": "A puzzle piece with the text 'V:trophy rank' taped onto it.",
          "actionType": "look"
        }
		{
          "condition": "!cyan_puzzle_piece",
          "text": "You have yet to find this puzzle piece.",
          "actionType": "look"
        }
      ]
    },
    "yellow_puzzle_piece": {
      "text": "A puzzle piece, with the text 'A:rooms amnt.' written in impeccable penmanship.",
      "conditions": [
        {
          "condition": "yellow_puzzle_piece",
          "text": "A puzzle piece, with the text 'A:rooms amnt.' written in impeccable penmanship.",
          "actionType": "look"
        }
		{
          "condition": "!yellow_puzzle_piece",
          "text": "You have yet to find this puzzle piece.",
          "actionType": "look"
        }
      ]
    },
    "the_solution": {
      "text": "CATHARSIS.",
      "conditions": [
        {
          "condition": "the_solution",
          "text": "<color=#008000>CATHARSIS</color>. Now, get to work.",
          "actionType": "look"
        },
		{
          "condition": "!the_solution",
          "text": "Not so fast. According to my immaculate system, you have yet to be granted entrance into my illustrious domain. Thought you could outsmart me, HMMMM!?",
          "actionType": "look"
        }
      ]
    },
    "secretFloppy": {
      "text": "Your super secret floppy disk containing 'The Payload'.",
      "conditions": [
        {
          "condition": "secretFloppy",
          "text": "Your super secret floppy disk containing 'The Payload'.",
          "actionType": "look"
        },
		{
          "condition": "!secretFloppy",
          "text": "Alas, Alan's atlas has yet to amass on your floppy, so you must at last yell 'avast!' while aghast. \nSorry, that was mean of me.",
          "actionType": "look"
        }
      ]
    }
  }
}
